# parameters
nc: 29  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
#  [[-1, 1, Focus, [8, 3]],  # 0-P1/2
   [[-1, 1, Focus, [8, 3, 2]],
   [-1, 1, MBConvBlock, [8, 4]], # 1
   [-1, 1, MBConvBlock, [8, 4]], # 2
   [[-1, 1], 1, Concat, [1]],    # 3
   [-1, 1, MBConvBlock, [24, 8, 3, 2]],  # 4-P2/4
   [-1, 1, MBConvBlock, [32, 8]], # 5
   [[-1, 4], 1, Concat, [1]],     # 6
   [-1, 1, MBConvBlock, [32, 8]], # 7
   [[-1, 6], 1, Concat, [1]],     # 8
   [-1, 1, MBConvBlock, [32, 8, 3, 2]],  # 9-P3/8
   [-1, 1, MBConvBlock, [48, 8]], # 10
   [[-1, 9], 1, Concat, [1]],    # 11
   [-1, 1, MBConvBlock, [48, 8]], # 12
   [[-1, 11], 1, Concat, [1]],    # 13
   [-1, 1, MBConvBlock, [48, 16]], # 14
   [-1, 1, MBConvBlock, [96, 16]], # 15
   [[-1, 14], 1, Concat, [1]],     # 16
   [-1, 1, MBConvBlock, [96, 16]], # 17
   [[-1, 16], 1, Concat, [1]],     # 18
   [-1, 1, MBConvBlock, [96, 16]], # 19
   [[-1, 18], 1, Concat, [1]],     # 20
   [-1, 1, MBConvBlock, [96, 16]],   # 21
   [[-1, 20], 1, Concat, [1]],       # 22
   [-1, 1, MBConvBlock, [96, 24, 3, 2]],  # 23-P4/16
   [-1, 1, MBConvBlock, [136, 24]],  # 24
   [[-1, 23], 1, Concat, [1]],       # 25
   [-1, 1, MBConvBlock, [136, 24]],  # 26
   [[-1, 25], 1, Concat, [1]],       # 27
   [-1, 1, MBConvBlock, [136, 24]],  # 28
   [[-1, 27], 1, Concat, [1]],       # 29
   [-1, 1, MBConvBlock, [136, 24]],  # 30
   [[-1, 29], 1, Concat, [1]],       # 31
   [-1, 1, MBConvBlock, [136, 48, 3, 2]],  # 32-P5/32
   [-1, 1, MBConvBlock, [224, 48]],  # 33
   [[-1, 32], 1, Concat, [1]],       # 34
   [-1, 1, MBConvBlock, [224, 48]],  # 35
   [[-1, 34], 1, Concat, [1]],       # 36
   [-1, 1, MBConvBlock, [224, 48]],  # 37
   [[-1, 36], 1, Concat, [1]],       # 38
   [-1, 1, MBConvBlock, [224, 48]],  # 39
   [[-1, 38], 1, Concat, [1]],       # 40
   [-1, 1, MBConvBlock, [224, 48]],  # 41
   [[-1, 40], 1, Concat, [1]],       # 42
#   [-1, 1, MBConvBlock, [96, 128, 5, 1]],  # 1-P2/64
#   [-1, 1, MBConvBlock, [128, 75, 5, 1]],  # 1-P2/128
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [104, 1, 1]],       # 43
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 44
   [[-1, 31], 1, Concat, [1]],  # cat backbone P4   # 45
   [-1, 3, BottleneckCSP, [104, False]],  # 46

   [-1, 1, Conv, [56, 1, 1]],   # 47
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 48
   [[-1, 22], 1, Concat, [1]],  # cat backbone P3   # 49
   [-1, 3, BottleneckCSP, [56, False]],  # 50 (P3/8-small)

   [-1, 1, Conv, [56, 3, 2]],      # 51
   [[-1, 47], 1, Concat, [1]],  # cat head P4    # 52
   [-1, 3, BottleneckCSP, [104, False]],  # 53 (P4/16-medium)

   [-1, 1, Conv, [104, 3, 2]],      # 54
   [[-1, 42], 1, Concat, [1]],  # cat head P5      # 55
   [-1, 3, BottleneckCSP, [208, False]],  # 56 (P5/32-large)

   [[50, 53, 56], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
